{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.3", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "dtype": "float32", "padding": "valid", "batch_input_shape": [null, 1, 24, 32], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_1", "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "axis": -1, "center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_1", "data_format": "channels_first", "padding": [[1, 1], [1, 1]]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_2", "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_2", "data_format": "channels_first", "padding": [[1, 1], [1, 1]]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_3", "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_3", "data_format": "channels_first", "padding": [[1, 1], [1, 1]]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 16, "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null, "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "conv2d_4", "bias_regularizer": null, "strides": [1, 1]}}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "name": "zero_padding2d_4", "data_format": "channels_first", "padding": [[1, 1], [1, 1]]}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "data_format": "channels_first", "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "relu", "trainable": true, "units": 16, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "softmax", "trainable": true, "units": 3, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "activity_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null}}]}