{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 32, "kernel_size": [3, 3], "bias_regularizer": null, "use_bias": true, "data_format": "channels_first", "kernel_regularizer": null, "activation": "relu", "dtype": "float32", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "strides": [1, 1], "trainable": true, "batch_input_shape": [null, 1, 24, 32], "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_5", "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "trainable": true, "name": "batch_normalization_2"}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_5", "data_format": "channels_first", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "filters": 32, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "data_format": "channels_first", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_6", "data_format": "channels_first", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true, "name": "max_pooling2d_4", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "filters": 16, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "data_format": "channels_first", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_7", "data_format": "channels_first", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true, "name": "max_pooling2d_5", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_constraint": null, "filters": 16, "strides": [1, 1], "bias_regularizer": null, "use_bias": true, "data_format": "channels_first", "kernel_regularizer": null, "activation": "relu", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_size": [3, 3], "name": "conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "ZeroPadding2D", "config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_8", "data_format": "channels_first", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_first", "trainable": true, "name": "max_pooling2d_6", "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "units": 16, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_4", "noise_shape": null, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "units": 3, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "trainable": true, "bias_constraint": null, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.1.3", "backend": "tensorflow"}