{"backend": "tensorflow", "keras_version": "2.1.3", "config": [{"config": {"kernel_size": [3, 3], "trainable": true, "data_format": "channels_first", "batch_input_shape": [null, 1, 24, 32], "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_constraint": null, "name": "conv2d_1", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "center": true, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null, "momentum": 0.99, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"name": "zero_padding2d_1", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_first"}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "data_format": "channels_first", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_constraint": null, "name": "conv2d_2", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 32, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"name": "zero_padding2d_2", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_first"}, "class_name": "ZeroPadding2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "data_format": "channels_first", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_constraint": null, "name": "conv2d_3", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 16, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_3", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_first"}, "class_name": "ZeroPadding2D"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "trainable": true, "data_format": "channels_first", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_constraint": null, "name": "conv2d_4", "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "filters": 16, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "zero_padding2d_4", "padding": [[1, 1], [1, 1]], "trainable": true, "data_format": "channels_first"}, "class_name": "ZeroPadding2D"}, {"config": {"name": "max_pooling2d_3", "padding": "valid", "trainable": true, "data_format": "channels_first", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_constraint": null, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "units": 16, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.25, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_constraint": null, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "units": 3, "kernel_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}