{"config": [{"config": {"kernel_regularizer": null, "name": "conv2d_29", "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "batch_input_shape": [null, 1, 24, 32], "trainable": true, "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_8", "axis": -1, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_constraint": null, "center": true, "scale": true, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_29", "trainable": true, "data_format": "channels_first"}, "class_name": "ZeroPadding2D"}, {"config": {"kernel_regularizer": null, "name": "conv2d_30", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_30", "trainable": true, "data_format": "channels_first"}, "class_name": "ZeroPadding2D"}, {"config": {"name": "max_pooling2d_22", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "name": "conv2d_31", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "filters": 32, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_31", "trainable": true, "data_format": "channels_first"}, "class_name": "ZeroPadding2D"}, {"config": {"name": "max_pooling2d_23", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_regularizer": null, "name": "conv2d_32", "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "filters": 16, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activation": "relu", "kernel_size": [3, 3], "trainable": true, "data_format": "channels_first", "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": [[1, 1], [1, 1]], "name": "zero_padding2d_32", "trainable": true, "data_format": "channels_first"}, "class_name": "ZeroPadding2D"}, {"config": {"name": "max_pooling2d_24", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_8", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_regularizer": null, "name": "dense_15", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "relu", "units": 16, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_regularizer": null, "name": "dense_16", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "softmax", "units": 3, "trainable": true, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.3", "backend": "tensorflow"}